Revit 2027 API
BuiltInFailures.MEPFabricationFailures.PinnedFabricationPartNotReposition Property
 Failed to reposition part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PinnedFabricationPartNotReposition { get; }
Public Shared ReadOnly Property PinnedFabricationPartNotReposition As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PinnedFabricationPartNotReposition {
	FailureDefinitionId^ get ();
}
static member PinnedFabricationPartNotReposition : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace